{"main":{"name":"David Mwangi Wanjiru","occupation":"Frontend Developer && Technical Lead @MMUSTihub","description":"","image":"mwas1.webp","bio":"I'm a Frontend Software Developer proficient in ReactJS, Next.js, and Tailwind CSS. With expertise in JavaScript and Node.js, I craft seamless web experiences and responsive designs. Skilled in Git and Python, I prioritize software quality and efficient workflows. Passionate about bug tracking and resolution, I'm committed to excellence in software development. Currently I'm The Frontend Developer and Technical Lead @MMUSTihub, I'm dedicated to continuous learning and innovation.","contactmessage":"Get in touch with me","email":"dmwas704@gmail.com","phone":"+254 795290373","address":{"street":"Naivasha Town","city":"Nakuru","state":"Kenya","zip":"20117"},"website":"https://david-mwas.me","resumedownload":"https://david-mwas.me/DAVIDMWANGIWANJIRU%20CVLTS.pdf","social":[{"name":"github","url":"https://github.com/David-mwas","className":"fa fa-github"},{"name":"gtwitter","url":"https://x.com/DavidMwas2_0","className":"fa fa-twitter"},{"name":"linkedin","url":"https://www.linkedin.com/in/david-mwas-a57186235/","className":"fa fa-linkedin"}]},"resume":{"skillmessage":"My Programming Language Proficiency","education":[{"school":"Masinde Murilo University Of Science And Technology","degree":"Bachelor's Degree, Information Technology","graduated":"Final Year","description":"Currently Am On My Final Year"}],"work":[{"company":"MMUSTihub","title":"Frontend Developer && Technical Lead","years":"May 2023 - Present","description":"<ul>\n<li><strong>Led front-end development projects</strong> to enhance user experience and implement UI/UX improvements across web and mobile platforms, using <strong>React</strong>, <strong>React Native</strong>, and <strong>Next.js</strong>.</li>\n<li><strong>Conducted quality assurance testing</strong> by creating detailed test cases in <strong>Postman</strong> and <strong>ThunderClient</strong>, tracking issues to ensure high functionality and usability.</li>\n<li><strong>Developed and collaborated on key projects</strong> including:\n<ul>\n<li><strong>Fololimo</strong>: A mobile app for farmers, integrating <strong>AI/ML</strong> and <strong>IoT</strong> technologies to provide real-time climate data and farming insights.</li>\n<li><strong>MMUSTJOSA</strong>: A journalism team news web app, delivering a responsive, user-friendly interface and cross-browser compatibility.</li>\n<li><strong>OPPS</strong>: An online proposal system for streamlined submissions and reviews.</li>\n<li><strong>InnerGlow</strong>: A mental health and awareness platform supporting accessibility and user-centric features.</li>\n</ul>\n</li>\n<li><strong>Improved responsiveness and accessibility</strong> by implementing front-end optimizations using <strong>React</strong>, <strong>Tailwind CSS</strong>, and <strong>Next.js</strong>, delivering high-quality, SEO-friendly interfaces.</li>\n<li><strong>Collaborated closely with product and design teams</strong> to ensure designs aligned with accessibility and responsive design standards.</li>\n</ul>"},{"company":"ALX Africa","title":"Software Engineering Trainee","years":"06/2022 - 10/2024","description":"<ul>\n<li><strong>Developed and tested web applications</strong> using JavaScript, React, and Tailwind CSS, focusing on seamless user interfaces and performance optimization.</li>\n<li><strong>Gained hands-on experience with version control</strong>, collaborating on GitHub, and enhancing teamwork skills.</li>\n</ul>"}]},"testimonials":{"testimonials":[{"text":"David is absolutely excellent, his depth of knowledge & his mentorship really meant a lot to us... I would definitely recommend","user":"Binary Brigades"}]}}